Documents/_ВозвратОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>_ВозвратОтПокупателя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТовара</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКонсигнации</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВернутьДеньги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходняНакладная</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаВозврата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныВозврата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Comment>в валюте док-та продажи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВБазВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаценкаВБазВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Партии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПартии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ЦенаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупкиВБазВалюте</Name>
					<Comment>в долларах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/_ВозвратОтПокупателя/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;
	
	Если гоНПЗ(Параметры.ЗначениеКопирования) Тогда
		Сообщить(НСтр("ru = 'Копирование возвратных накладных запрещено!'; en = 'Copying return from buyer is prohibited!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// © Primus1C  27.12.2023  НАЧАЛО ►
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента);  

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Склад = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Склад");
	КонецЕсли;	
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	РаботаСоСканеромШК.СканерШКПодключить();
	
	ТолПро = ЭтаФорма.ТолькоПросмотр;
	
	//этоЧужой = Ложь;
	//Если НЕ Объект.Ссылка.Пустая() Тогда 
	//	этоЧужой = НЕ Объект.КемСоздан = гоПользователь() 
	//	//И НЕ ЭтоОператор()
	//	;
	//КонецЕсли;
	//
	//Если этоЧужой Тогда
	//	ТолПро = Истина;
	//КонецЕсли;
	//
	//ЭтаФорма.ТолькоПросмотр			 = ТолПро;
	Элементы.РучнойШК.ТолькоПросмотр = ТолПро;
	
	стрПросмотр = клПросмотр(ЭтаФорма, Ложь, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ (ЭтаФорма.Окно = АктивноеОкно()) Тогда
		Возврат;
	КонецЕсли;
	
	ШК = "";
	Если РаботаСоСканеромШК.СканерШКНачатьОбработку(Источник, Событие, Данные, ШК) Тогда
		// © Primus1C  31.12.2025  НАЧАЛО ►
		//ДобавитьДанныеПоВозвратуСерии(ШК);
		мас = Новый Массив;
		мас.Добавить(ШК);
        ДобавитьВТЧСтрокиСерии(мас);
		// © Primus1C  ОКОНЧАНИЕ ◄
		РаботаСоСканеромШК.СканерШКЗавершитьОбработку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

#КонецОбласти


// © Primus1C  24.11.2025  НАЧАЛО ►

#Область Команды

&НаКлиенте
Процедура ИзБуфераОбмена(Команда)

	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	//Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	//МоиИтоги();
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Warehouse not specified!'")); Возврат; КонецЕсли; 
	//Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	
	//Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	РаботаСоСканеромШК.ПолучитьИМЕИИзБуфера(Новый ОписаниеОповещения("ИзБуфераОбменаПослеПолученияБуфера", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераОбменаПослеПолученияБуфера(Буф, ДопПараметры) Экспорт
	
	////2016.04.23
	////если уже есть такой товар, зачем искать цену
	//ЕстЦен = 0;
	//Если Объект.Товары.Количество() <> 0 Тогда
	//	Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
	//	Если Мас.Количество() <> 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	//КонецЕсли; 
	//
	////2016.04.23
	//Если ЕстЦен <> 0 Тогда 
	//	НовЦен = ЕстЦен;
	//Иначе 
	//	НовЦен = 0;
	//	Если НЕ ВвестиЧисло(НовЦен, НСтр("ru = 'Цена (0 - взять цены прихода)'; en = 'Price (0 - take arrival prices)'"), 19, ЧислоЗнаковЦена) Тогда Возврат КонецЕсли;  
	//КонецЕсли;
	
	КвоСтрок = СтрЧислоСтрок(Буф);
	
	// массив нужен чтобы сохранить порядок серий
	мас = Новый Массив;
	Для Н = 1 По КвоСтрок Цикл
		НовСер = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (НовСер = "") И (С <> "") Цикл
			НовСер = гоСледПолеТаб(С);
		КонецЦикла;	
		серия = СокрЛП(НовСер);
		Если серия = "" Тогда
			Продолжить;		
		Иначе
			мас.Добавить(серия);
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьВТЧСтрокиСерии(мас);

	//СоотвПартий = СведенияПартий(мас);
	//
	//Ошибки = Новый СписокЗначений;
	//НовыхСтрок = 0;
	//Для каждого Эл Из мас Цикл
	//	СведенияПартии = СоотвПартий.Получить(Эл);
	//	Если СведенияПартии = Неопределено Тогда
	//		Ошибки.Добавить(СтрШаблон("%1: %2", НСтр("ru = 'Нет продаж серии'; en = 'No series sales'"), Эл));
	//	Иначе
	//		НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Партия", СведенияПартии.Партия));
	//		Если НайдСтроки.Количество() > 0 Тогда
	//			Ошибки.Добавить(СтрШаблон("%1 %2 %3 !", НСтр("ru = 'Cерия'; en = 'Series'"), Эл, НСтр("ru = 'уже есть в накладной'; en = 'is already in document'")));   
	//		    Продолжить;
	//		КонецЕсли;
	//		НовСтр = Объект.Товары.Добавить();
	//		НовСтр.Серия 			= Эл;
	//		НовСтр.Номенклатура 	= СведенияПартии.Номенклатура;
	//		НовСтр.Партия 			= СведенияПартии.Партия; 
	//		НовСтр.ЦенаПродажи 		= СведенияПартии.Цена; 
	//		НовСтр.СуммаПродажи		= СведенияПартии.Цена; 
	//		НовСтр.Количество 		= 1; 
	//		НовСтр.Валюта 			= СведенияПартии.Валюта; 
	//		НовСтр.Контрагент 		= СведенияПартии.Контрагент; 
	//		НовСтр.РасходняНакладная= СведенияПартии.Регистратор;
	//		НовыхСтрок = НовыхСтрок + 1;
	//	КонецЕсли;
	//КонецЦикла;	
	//
	////МояЗаписать(Ложь);
	//гоЗаписьЖурналаРегистрации("Добавлено из буфера обмена строк: " + НовыхСтрок, ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строк", Объект.Ссылка, 2);
	//
	//Если Объект.Товары.Количество() > 0  Тогда
	//	ИДИ = Объект.Товары[Объект.Товары.Количество()-1].ПолучитьИдентификатор();
	//    Элементы.Товары.ТекущаяСтрока = ИДИ;
	//КонецЕсли;

	////МоиИтоги();

	//Если Ошибки.Количество() > 0 Тогда   
	//	ТекстОшибок = "";
	//	Для каждого Ош Из Ошибки Цикл
	//		ТекстОшибок = ТекстОшибок + Ош.Значение + Символы.ПС;
	//	КонецЦикла;
	//	клОшибка(ТекстОшибок, , НСтр("ru = 'Ошибки заполнения'; en = 'Filling Errors'"));
	//КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СведенияПартий(МассивСерий)
	
	МассивВРег = Новый Массив;
	МассивНРег = Новый Массив;
	Для каждого Эл Из МассивСерий Цикл
		МассивВРег.Добавить(Врег(Эл));
		МассивНРег.Добавить(Нрег(Эл));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПартии", Объект.Дата);
	Запрос.УстановитьПараметр("Серии",  	МассивСерий);
	Запрос.УстановитьПараметр("СерииНРег",  МассивВРег);
	Запрос.УстановитьПараметр("СерииВРег",  МассивНРег);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Партии.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ втПартииСЗаданойСерией
	               |ИЗ
	               |	Справочник.Партии КАК Партии
	               |ГДЕ
	               |	(Партии.Серия В (&Серии)
	               |			ИЛИ Партии.Серия В (&СерииНРег)
	               |			ИЛИ Партии.Серия В (&СерииВРег))
	               |	И Партии.ДатаПартии < &ДатаПартии
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Продажи.Номенклатура КАК Номенклатура,
	               |	Продажи.Партия КАК Партия,
	               |	Продажи.Партия.Серия КАК Серия,
	               |	Продажи.Регистратор КАК Регистратор,
	               |	Продажи.Валюта КАК Валюта,
	               |	Продажи.Покупатель КАК Контрагент,
	               |	Продажи.СуммаОборот / Продажи.КоличествоОборот КАК Цена,
	               |	(Продажи.СуммаОборот + Продажи.НаценкаОборот) / Продажи.КоличествоОборот КАК ЦенаСНаценкой
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			,
	               |			,
	               |			Запись,
	               |			Партия В
	               |				(ВЫБРАТЬ
	               |					ВТ.Ссылка
	               |				ИЗ
	               |					втПартииСЗаданойСерией КАК ВТ)) КАК Продажи
	               |ГДЕ
	               |	Продажи.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Продажи.Период";
	Выборка = Запрос.Выполнить().Выбрать(); 
	СоотвПартий = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СведенияПартии = Новый Структура("Партия,Серия,Номенклатура,Регистратор,Валюта,Контрагент,Цена,ЦенаСНаценкой", 
										Выборка.Партия, Выборка.Серия, Выборка.Номенклатура, Выборка.Регистратор, Выборка.Валюта, Выборка.Контрагент, Выборка.Цена, Выборка.ЦенаСНаценкой);
		СоотвПартий.Вставить(Выборка.Серия, СведенияПартии);
		СоотвПартий.Вставить(ВРег(Выборка.Серия), СведенияПартии);
		СоотвПартий.Вставить(НРег(Выборка.Серия), СведенияПартии);
	КонецЦикла;
	Возврат СоотвПартий;
	
КонецФункции 

&НаКлиенте
Процедура ДобавитьВТЧСтрокиСерии(МассивСерий)

	СоотвПартий = СведенияПартий(МассивСерий);
	
	Ошибки = Новый СписокЗначений;
	НовыхСтрок = 0;
	Для каждого Эл Из МассивСерий Цикл
		СведенияПартии = СоотвПартий.Получить(Эл);
		Если СведенияПартии = Неопределено Тогда
			Ошибки.Добавить(СтрШаблон("%1: %2", НСтр("ru = 'Нет продаж серии'; en = 'No series sales'"), Эл));
		Иначе
			//НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Партия", СведенияПартии.Партия));  
			НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Серия", Эл));
			Если НайдСтроки.Количество() > 0 Тогда
				Ошибки.Добавить(СтрШаблон("%1 %2 %3 !", НСтр("ru = 'Cерия'; en = 'Series'"), Эл, НСтр("ru = 'уже есть в накладной'; en = 'is already in document'")));   
			    Продолжить;
			КонецЕсли;
			НовСтр = Объект.Товары.Добавить();
			НовСтр.Серия 			= Эл;
			НовСтр.Номенклатура 	= СведенияПартии.Номенклатура;
			НовСтр.Партия 			= СведенияПартии.Партия; 
			НовСтр.ЦенаПродажи 		= СведенияПартии.Цена; 
			НовСтр.СуммаПродажи		= СведенияПартии.Цена; 
			НовСтр.Количество 		= 1; 
			НовСтр.Валюта 			= СведенияПартии.Валюта; 
			НовСтр.Контрагент 		= СведенияПартии.Контрагент; 
			НовСтр.РасходняНакладная= СведенияПартии.Регистратор;
			НовыхСтрок = НовыхСтрок + 1;
		КонецЕсли;
	КонецЦикла;	
	
	//МояЗаписать(Ложь);
	Если МассивСерий.ВГраница() > 0 Тогда
		гоЗаписьЖурналаРегистрации("Добавлено из буфера обмена строк: " + НовыхСтрок, ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строк", Объект.Ссылка, 2);
	КонецЕсли; 

	РучнойШК = "";
		
	Если Объект.Товары.Количество() > 0  Тогда
		ИДИ = Объект.Товары[Объект.Товары.Количество()-1].ПолучитьИдентификатор();
	    Элементы.Товары.ТекущаяСтрока = ИДИ;
	КонецЕсли;

	ОбновитьИтоги();

	Если Ошибки.Количество() > 0 Тогда   
		ТекстОшибок = "";
		Для каждого Ош Из Ошибки Цикл
			ТекстОшибок = ТекстОшибок + Ош.Значение + Символы.ПС;
		КонецЦикла;
		клОшибка(ТекстОшибок, , НСтр("ru = 'Ошибки заполнения'; en = 'Filling Errors'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()

	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект);
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	ОбновитьИтоги();
КонецПроцедуры

#КонецОбласти

// © Primus1C  ОКОНЧАНИЕ ◄


&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	клОшибка(НСтр("ru = 'Ручное заполнение недоступно! Введите штрих-код'; en = 'Manual filling is not available! Please enter the barcode.'"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВыборкуПоШКНаСервере(ШК_Серии, ДатаВозврата)
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура");
	Результат.Вставить("Партия");
	Результат.Вставить("Серия");
	Результат.Вставить("Контрагент");
	Результат.Вставить("ЦенаПродажи");
	Результат.Вставить("Количество");
	Результат.Вставить("СуммаПродажи");
	Результат.Вставить("Регистратор");
	Результат.Вставить("Валюта");
	Результат.Вставить("ТекстПредупреждения", НСтр("ru = 'Для выбраного штрихкода не найдена история реализации!'; en = 'No sales history found for the selected barcode!'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Партии.Ссылка
	               |ПОМЕСТИТЬ втПартииСЗаданойСерией
	               |ИЗ
	               |	Справочник.Партии КАК Партии
	               |ГДЕ
	               |	Партии.Серия = &Серия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиТовараОстаткиИОбороты.Номенклатура,
	               |	ОстаткиТовараОстаткиИОбороты.Партия,
	               |	ОстаткиТовараОстаткиИОбороты.Партия.Серия КАК Серия,
	               |	ОстаткиТовараОстаткиИОбороты.Регистратор,
	               |	ПродажиОбороты.Валюта КАК Валюта,
	               |	ПродажиОбороты.Покупатель КАК Контрагент,
	               |	ПродажиОбороты.СуммаОборот / ПродажиОбороты.КоличествоОборот КАК СуммаПродажи
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТовара.ОстаткиИОбороты(
	               |			,
	               |			,
	               |			Регистратор,
	               |			,
	               |			Партия В
	               |				(ВЫБРАТЬ
	               |					втПартииСЗаданойСерией.Ссылка
	               |				ИЗ
	               |					втПартииСЗаданойСерией КАК втПартииСЗаданойСерией)) КАК ОстаткиТовараОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
	               |		ПО ОстаткиТовараОстаткиИОбороты.Регистратор = ПродажиОбороты.Регистратор
	               |			И ОстаткиТовараОстаткиИОбороты.Номенклатура = ПродажиОбороты.Номенклатура
	               |ГДЕ
	               |	(ОстаткиТовараОстаткиИОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	               |			ИЛИ ОстаткиТовараОстаткиИОбороты.Регистратор ССЫЛКА Документ._ВозвратОтПокупателя)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОстаткиТовараОстаткиИОбороты.Период УБЫВ";
	Запрос.УстановитьПараметр("Серия", ШК_Серии);
	//Запрос.УстановитьПараметр("Дата", ДатаВозврата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
				ЗаполнитьЗначенияСвойств(Результат, Выборка); 
				// © Primus1C  18.03.2024  НАЧАЛО ►
				// исправим цену (в Расх.накл. м.быть один товар с разными ценами; если при этом серии различны, уточним цену)  
				// 				 (не решает ситуацию, если одна серия продавалась по разными ценам)
				Запр = Новый Запрос;
				Запр.Текст = "ВЫБРАТЬ
				             |	СРЕДНЕЕ(РасходнаяНакладнаяТовары.СуммаПродажи / РасходнаяНакладнаяТовары.Количество) КАК ЦенаПродажи
				             |ИЗ
				             |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
				             |ГДЕ
				             |	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
				             |	И РасходнаяНакладнаяТовары.Серия = &Серия";
				Запр.УстановитьПараметр("Ссылка", Выборка.Регистратор);
				Запр.УстановитьПараметр("Серия", ШК_Серии); 
				Выб = Запр.Выполнить().Выбрать();
				Если Выб.Следующий() Тогда
					Результат.Вставить("СуммаПродажи", Выб.ЦенаПродажи);
				КонецЕсли;
				// © Primus1C  ОКОНЧАНИЕ ◄
			ИначеЕсли ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка._ВозвратОтПокупателя") Тогда
				Результат.Вставить("ТекстПредупреждения", НСтр("ru = 'Эта позиция уже была возвращена документом '; en = 'This position has already been returned by the document '") + Выборка.Регистратор);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьВыборкуПоШКНаСервере()

&НаКлиенте
Процедура ДобавитьДанныеПоВозвратуСерии(ШК_Серии, ОчищатьПолеВвода = Истина)
	
	Если НЕ ЗначениеЗаполнено(ШК_Серии) Тогда Возврат КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Серия", ШК_Серии);
	
	РезультатПоиска = Объект.Товары.НайтиСтроки(СтруктураПоиска);
	
	Если РезультатПоиска.Количество() > 0 Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ДобавитьДанныеПоВозвратуСерииПослеПредупрежденияДубля", ЭтотОбъект,
			Новый Структура("ШК_Серии,ОчищатьПолеВвода", ШК_Серии, ОчищатьПолеВвода)),
			НСтр("ru = 'Данный штрих код уже отсканирован в документе!'; en = 'This barcode has already been scanned in the document!'"));
		Возврат;
	КонецЕсли;
	
	ДобавитьДанныеПоВозвратуСерииШаг2(ШК_Серии, ОчищатьПолеВвода);
	
КонецПроцедуры // ПолучитьВыборкуПоШКНаСервере()

&НаКлиенте
Процедура ДобавитьДанныеПоВозвратуСерииПослеПредупрежденияДубля(ДопПараметры) Экспорт
	ШК_Серии = ДопПараметры.ШК_Серии;
	ОчищатьПолеВвода = ДопПараметры.ОчищатьПолеВвода;
	
	Если ОчищатьПолеВвода Тогда
		РучнойШК = "";
		Возврат;
	КонецЕсли;
	
	ДобавитьДанныеПоВозвратуСерииШаг2(ШК_Серии, ОчищатьПолеВвода);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДанныеПоВозвратуСерииШаг2(ШК_Серии, ОчищатьПолеВвода)
	
	Выборка = ПолучитьВыборкуПоШКНаСервере(ШК_Серии, Объект.Дата);
	
	Если Выборка.Номенклатура = Неопределено Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ДобавитьДанныеПоВозвратуСерииПослеЗавершения", ЭтотОбъект, ОчищатьПолеВвода), Выборка.ТекстПредупреждения);
		Возврат;
	Иначе
		НоваяСтрока						 = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура		 = Выборка.Номенклатура;
		НоваяСтрока.Партия				 = Выборка.Партия;
		НоваяСтрока.Серия				 = Выборка.Серия;
		НоваяСтрока.Контрагент			 = Выборка.Контрагент;;
		НоваяСтрока.Количество			 = 1;
		НоваяСтрока.ЦенаПродажи			 = Выборка.СуммаПродажи;
		НоваяСтрока.СуммаПродажи		 = Выборка.СуммаПродажи;
		НоваяСтрока.РасходняНакладная	 = Выборка.Регистратор;
		НоваяСтрока.Валюта				 = Выборка.Валюта;
	КонецЕсли;
	
	ДобавитьДанныеПоВозвратуСерииЗавершение(ОчищатьПолеВвода);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДанныеПоВозвратуСерииПослеЗавершения(ОчищатьПолеВвода) Экспорт
	ДобавитьДанныеПоВозвратуСерииЗавершение(ОчищатьПолеВвода);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДанныеПоВозвратуСерииЗавершение(ОчищатьПолеВвода)
	Если ОчищатьПолеВвода Тогда
		РучнойШК = "";
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)
	
	// © Primus1C  31.12.2025  НАЧАЛО ►
	//ДобавитьДанныеПоВозвратуСерии(РучнойШК);   
	мас = Новый массив;
	мас.Добавить(РучнойШК);
	ДобавитьВТЧСтрокиСерии(мас);
	// © Primus1C  ОКОНЧАНИЕ ◄
	
КонецПроцедуры
